CS-3383/notes/html_output/1 - Introduction to Theory of Automata.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 16:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction to Theory of Automata</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Introduction to Theory of Automata</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org8f4170b">1. Regarding grading</a></li>
<li><a href="#org8d803a1">2. Why study automata?</a>
<ul>
<li><a href="#orgd00a063">2.1. What is automata</a></li>
<li><a href="#org6e44876">2.2. What is an algorithm.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Taken from: 
</p>
<ul class="org-ul">
<li><b>Elements of the Theory of Computation</b> (2nd Edition) by <b>Harry R. Lewis</b> and <b>Christos H. Papadimitriou</b>.</li>
<li><b>Introduction to the Theory of Computation</b> by <b>Michael Sipser</b>.</li>
</ul>
<div id="outline-container-org8f4170b" class="outline-2">
<h2 id="org8f4170b"><span class="section-number-2">1.</span> Regarding grading</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>No communication with classmates. It will be treated as cheating, which is -5 points for each warning.</li>
<li>No AI tools allowed.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d803a1" class="outline-2">
<h2 id="org8d803a1"><span class="section-number-2">2.</span> Why study automata?</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgd00a063" class="outline-3">
<h3 id="orgd00a063"><span class="section-number-3">2.1.</span> What is automata</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<span class="underline">Auto</span> means <b>Moving</b>
</p>

<p>
<span class="underline">Mata</span> means <b>Machine</b>
</p>

<p>
Therefore, <b>Moving Machine</b> or <b>Functioning Machine</b>
</p>

<ul class="org-ul">
<li>Robot, humanoid, computer, android, mechanism</li>
<li>For an <b>Algorithm</b> to execute, it needs a machine to execute it.</li>
<li>Our most standard and ancient intution on algorithm follows from a calculator. (computing automataon)
<ul class="org-ul">
<li>Abbacus, Cash register, etc.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org6e44876" class="outline-3">
<h3 id="org6e44876"><span class="section-number-3">2.2.</span> What is an algorithm.</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>The <b>automata</b> is the chef/cook.</li>
<li>The <b>algorithm</b> would be the recipe.</li>
</ul>

<p>
For cheesecake, for example, you need to follow certain steps. Cream cheese, sugar, etc.
</p>

<p>
You cannot make a cheesecake without someone/something to cook it. You cannot grow cheesecake.
</p>

<p>
Each instruction is expressed by a finite number of symbols.
If it is carried without error, it produces the same result.
Whenever you design an algorithm, it is like designing a virtual machine.
Exploring the possibilities of algorithms is like exploring the possibilities of machines.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-17 Fri 16:30</p>
</div>
</body>
</html>
